In [1]:
import pandas as pd

In [2]:
import numpy as np

In [13]:
df = pd.DataFrame({"Name": ['Alfred', 'Batman', 'Alfred'],
                   "Toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "Born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [14]:
df

     Name        Toy       Born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [11]:
df.dropna(how='all')

       Name  Toy       Born
0    Alfred  NaN        NaT
1    Batman  NaN 1940-04-25
2  Catwoman  NaN        NaT

In [12]:
df.dropna(how='all',axis=1)

       Name       Born
0    Alfred        NaT
1    Batman 1940-04-25
2  Catwoman        NaT

In [16]:
df.drop_duplicates(subset=['Name'])

     Name        Toy       Born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25

In [18]:
df.drop_duplicates(subset=['Name'],keep='first')

     Name        Toy       Born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25

In [19]:
df.drop_duplicates(subset=['Name'],keep='last')

     Name        Toy       Born
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [20]:
df.drop_duplicates(subset=['Name'],keep=False)

     Name        Toy       Born
1  Batman  Batmobile 1940-04-25

In [22]:
df.shape

(3, 3)

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Toy     2 non-null      object
 2   Born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 204.0+ bytes

In [26]:
df['Toy'].value_counts(dropna=False)

Toy
NaN          1
Batmobile    1
Bullwhip     1
Name: count, dtype: int64

In [27]:
df.notnull()

   Name    Toy   Born
0  True  False  False
1  True   True   True
2  True   True  False

In [28]:
df.isnull()

    Name    Toy   Born
0  False   True   True
1  False  False  False
2  False  False   True